app/Controllers/Usuarios.php

    public function valida()
    {
        if ($this->request->getMethod() == 'POST' && $this->validate($this->reglaslogin)) {

            $usuario = $this->request->getPost('usuario');
            $password = $this->request->getPost('password');
            $user = $this->usuarios->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'Administradora'
 LIMIT 1