app/Models/ProductosModel.php

    public function totalProductos()
    {
       return $this->where("activo", 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1