app/Models/VentasModel.php

    public function totalDia($fecha)
    {
        $this->select("SUM(total) AS total");
        $where = "activo = 1 AND DATE(fecha_alta) = '$fecha'";
        return $this->where($where)->first();
---
SELECT SUM(total) AS total
FROM `ventas`
WHERE `activo` = 1 AND DATE(fecha_alta) = '2025-12-03'
 LIMIT 1